{
  "vocab_to_idx": {
    "the": 1,
    "of": 2,
    "to": 3,
    "in": 4,
    "is": 5,
    "and": 6,
    "we": 7,
    "for": 8,
    "that": 9,
    "this": 10,
    "learning": 11,
    "an": 12,
    "which": 13,
    "maxq": 14,
    "can": 15,
    "paper": 16,
    "it": 17,
    "decision": 18,
    "method": 19,
    "be": 20,
    "by": 21,
    "with": 22,
    "on": 23,
    "function": 24,
    "state": 25,
    "policy": 26,
    "as": 27,
    "are": 28,
    "order": 29,
    "from": 30,
    "hierarchical": 31,
    "performance": 32,
    "classifier": 33,
    "data": 34,
    "approach": 35,
    "target": 36,
    "value": 37,
    "conditions": 38,
    "domains": 39,
    "show": 40,
    "analysis": 41,
    "algorithms": 42,
    "complexity": 43,
    "case": 44,
    "hybrid": 45,
    "induction": 46,
    "inductive": 47,
    "logic": 48,
    "programming": 49,
    "tilde": 50,
    "ilp": 51,
    "its": 52,
    "abstractions": 53,
    "algorithm": 54,
    "experimentally": 55,
    "important": 56,
    "actions": 57,
    "under": 58,
    "cost": 59,
    "such": 60,
    "class": 61,
    "robust": 62,
    "clustering": 63,
    "trees": 64,
    "system": 65,
    "tree": 66,
    "examples": 67,
    "setting": 68,
    "reinforcement": 69,
    "based": 70,
    "functions": 71,
    "five": 72,
    "converges": 73,
    "optimal": 74,
    "known": 75,
    "abstraction": 76,
    "representation": 77,
    "has": 78,
    "makes": 79,
    "non": 80,
    "comparison": 81,
    "many": 82,
    "perform": 83,
    "developed": 84,
    "these": 85,
    "dynamics": 86,
    "constructed": 87,
    "thus": 88,
    "natural": 89,
    "one": 90,
    "reference": 91,
    "kolmogorov": 92,
    "well": 93,
    "may": 94,
    "available": 95,
    "computers": 96,
    "real": 97,
    "efficient": 98,
    "techniques": 99,
    "computational": 100,
    "top": 101,
    "down": 102,
    "tic": 103,
    "propositional": 104,
    "two": 105,
    "memory": 106,
    "agent": 107,
    "partially": 108,
    "observable": 109,
    "cross": 110,
    "validation": 111,
    "presents": 112,
    "decomposing": 113,
    "process": 114,
    "mdp": 115,
    "into": 116,
    "hierarchy": 117,
    "smaller": 118,
    "mdps": 119,
    "proves": 120,
    "results": 121,
    "power": 122,
    "use": 123,
    "recursively": 124,
    "even": 125,
    "experiments": 126,
    "possible": 127,
    "finally": 128,
    "related": 129,
    "work": 130,
    "rl": 131,
    "defined": 132,
    "however": 133,
    "space": 134,
    "define": 135,
    "multiplicative": 136,
    "newton": 137,
    "like": 138,
    "situation": 139,
    "where": 140,
    "restricted": 141,
    "orthogonal": 142,
    "group": 143,
    "general": 144,
    "framework": 145,
    "restriction": 146,
    "problem": 147,
    "second": 148,
    "new": 149,
    "convergence": 150,
    "scaling": 151,
    "each": 152,
    "other": 153,
    "coset": 154,
    "point": 155,
    "any": 156,
    "computer": 157,
    "all": 158,
    "binary": 159,
    "strings": 160,
    "standard": 161,
    "only": 162,
    "they": 163,
    "not": 164,
    "depend": 165,
    "more": 166,
    "useful": 167,
    "if": 168,
    "include": 169,
    "calculus": 170,
    "example": 171,
    "some": 172,
    "world": 173,
    "usually": 174,
    "misclassification": 175,
    "costs": 176,
    "systems": 177,
    "build": 178,
    "best": 179,
    "extends": 180,
    "including": 181,
    "also": 182,
    "roc": 183,
    "adapts": 184,
    "allows": 185,
    "clear": 186,
    "empirical": 187,
    "indeed": 188,
    "problems": 189,
    "presented": 190,
    "aim": 191,
    "employs": 192,
    "first": 193,
    "logical": 194,
    "relational": 195,
    "expressive": 196,
    "efficiency": 197,
    "sets": 198,
    "handled": 199,
    "within": 200,
    "mining": 201,
    "main": 202,
    "assumption": 203,
    "interpretations": 204,
    "up": 205,
    "existing": 206,
    "classical": 207,
    "large": 208,
    "implementations": 209,
    "loads": 210,
    "lds": 211,
    "compare": 212,
    "explore": 213,
    "external": 214,
    "technique": 215,
    "overhead": 216,
    "markov": 217,
    "additive": 218,
    "combination": 219,
    "defines": 220,
    "formal": 221,
    "representational": 222,
    "establishes": 223,
    "safe": 224,
    "online": 225,
    "model": 226,
    "free": 227,
    "wih": 228,
    "probability": 229,
    "kind": 230,
    "locally": 231,
    "presence": 232,
    "kinds": 233,
    "evaluates": 234,
    "through": 235,
    "series": 236,
    "three": 237,
    "shows": 238,
    "much": 239,
    "faster": 240,
    "than": 241,
    "flat": 242,
    "fact": 243,
    "learns": 244,
    "benefit": 245,
    "compute": 246,
    "execute": 247,
    "improved": 248,
    "via": 249,
    "procedure": 250,
    "similar": 251,
    "improvement": 252,
    "step": 253,
    "iteration": 254,
    "demonstrates": 255,
    "effectiveness": 256,
    "execution": 257,
    "concludes": 258,
    "discussion": 259,
    "design": 260,
    "tradeoffs": 261,
    "researchers": 262,
    "have": 263,
    "explored": 264,
    "methods": 265,
    "temporal": 266,
    "abstract": 267,
    "primitive": 268,
    "before": 269,
    "terminating": 270,
    "little": 271,
    "about": 272,
    "aspects": 273,
    "ignored": 274,
    "previous": 275,
    "combined": 276,
    "decomposition": 277,
    "prove": 278,
    "successful": 279,
    "application": 280,
    "author": 281,
    "et": 282,
    "al": 283,
    "extended": 284,
    "without": 285,
    "specifying": 286,
    "though": 287,
    "groups": 288,
    "somewhat": 289,
    "complicated": 290,
    "explicit": 291,
    "expression": 292,
    "amount": 293,
    "individual": 294,
    "jumps": 295,
    "obtained": 296,
    "exactly": 297,
    "convergent": 298,
    "global": 299,
    "instability": 300,
    "inherent": 301,
    "remedied": 302,
    "levenberg": 303,
    "marquardt": 304,
    "type": 305,
    "variation": 306,
    "readily": 307,
    "applied": 308,
    "independent": 309,
    "component": 310,
    "remarkable": 311,
    "illustrated": 312,
    "numerical": 313,
    "simulation": 314,
    "construct": 315,
    "scratch": 316,
    "fourth": 317,
    "cumulant": 318,
    "stochastic": 319,
    "variables": 320,
    "updating": 321,
    "rule": 322,
    "here": 323,
    "homogeneous": 324,
    "nature": 325,
    "lie": 326,
    "numerous": 327,
    "merits": 328,
    "rigorous": 329,
    "treatment": 330,
    "consequence": 331,
    "shown": 332,
    "invariant": 333,
    "componentwise": 334,
    "choosen": 335,
    "identifying": 336,
    "points": 337,
    "transformed": 338,
    "assume": 339,
    "our": 340,
    "move": 341,
    "toward": 342,
    "direction": 343,
    "no": 344,
    "prewhitening": 345,
    "required": 346,
    "given": 347,
    "asymptotic": 348,
    "properties": 349,
    "considered": 350,
    "because": 351,
    "do": 352,
    "argue": 353,
    "refined": 354,
    "practical": 355,
    "simple": 356,
    "restrict": 357,
    "interesting": 358,
    "way": 359,
    "modeling": 360,
    "life": 361,
    "limited": 362,
    "physically": 363,
    "us": 364,
    "give": 365,
    "what": 366,
    "might": 367,
    "look": 368,
    "mathematically": 369,
    "restrictions": 370,
    "error": 371,
    "terms": 372,
    "logarithmic": 373,
    "disappear": 374,
    "keywords": 375,
    "algorithmic": 376,
    "information": 377,
    "theory": 378,
    "environments": 379,
    "difficult": 380,
    "specify": 381,
    "operating": 382,
    "precisely": 383,
    "uncertainty": 384,
    "building": 385,
    "classification": 386,
    "problematic": 387,
    "will": 388,
    "at": 389,
    "least": 390,
    "cases": 391,
    "actually": 392,
    "surpass": 393,
    "across": 394,
    "wide": 395,
    "variety": 396,
    "frameworks": 397,
    "optimization": 398,
    "metrics": 399,
    "accuracy": 400,
    "expected": 401,
    "lift": 402,
    "precision": 403,
    "recall": 404,
    "workforce": 405,
    "utilization": 406,
    "store": 407,
    "update": 408,
    "imprecise": 409,
    "distributions": 410,
    "convex": 411,
    "hull": 412,
    "rocch": 413,
    "combines": 414,
    "geometry": 415,
    "them": 416,
    "particulars": 417,
    "analyzing": 418,
    "learned": 419,
    "classifiers": 420,
    "incremental": 421,
    "minimizes": 422,
    "management": 423,
    "visual": 424,
    "comparisons": 425,
    "sensitivity": 426,
    "analyses": 427,
    "evidence": 428,
    "needed": 429,
    "basic": 430,
    "towards": 431,
    "principles": 432,
    "instance": 433,
    "resulting": 434,
    "methodology": 435,
    "implemented": 436,
    "various": 437,
    "both": 438,
    "when": 439,
    "comparing": 440,
    "attribute": 441,
    "there": 442,
    "trade": 443,
    "off": 444,
    "between": 445,
    "typically": 446,
    "but": 447,
    "less": 448,
    "therefore": 449,
    "current": 450,
    "small": 451,
    "according": 452,
    "standards": 453,
    "community": 454,
    "source": 455,
    "inefficiency": 456,
    "lies": 457,
    "several": 458,
    "so": 459,
    "cannot": 460,
    "independently": 461,
    "unnecessary": 462,
    "scale": 463,
    "explain": 464,
    "context": 465,
    "databases": 466,
    "relate": 467,
    "corresponds": 468,
    "multiple": 469,
    "relations": 470,
    "expressiveness": 471,
    "while": 472,
    "maintaining": 473,
    "extent": 474,
    "study": 475,
    "present": 476,
    "alternative": 477,
    "classic": 478,
    "showing": 479,
    "handle": 480,
    "or": 481,
    "mb": 482,
    "scales": 483,
    "linearly": 484,
    "number": 485,
    "necessary": 486,
    "history": 487,
    "observations": 488,
    "stigmergic": 489,
    "ability": 490,
    "set": 491,
    "bits": 492,
    "included": 493,
    "part": 494,
    "input": 495,
    "need": 496,
    "learn": 497,
    "reactive": 498,
    "highly": 499,
    "markovian": 500,
    "domain": 501,
    "sarsa": 502,
    "lambda": 503,
    "had": 504,
    "success": 505,
    "vaps": 506,
    "due": 507,
    "baird": 508,
    "moore": 509,
    "guarantees": 510,
    "benchmark": 511,
    "generally": 512,
    "applicable": 513,
    "often": 514,
    "employed": 515,
    "machine": 516,
    "disadvantage": 517,
    "straightforward": 518,
    "implementation": 519,
    "reduced": 520,
    "significantly": 521,
    "integrating": 522,
    "normal": 523,
    "discuss": 524,
    "how": 525,
    "adapted": 526,
    "provide": 527,
    "speedups": 528,
    "adaptations": 529,
    "yield": 530,
    "supported": 531,
    "experimental": 532
  },
  "idx_to_vocab": {
    "1": "the",
    "2": "of",
    "3": "to",
    "4": "in",
    "5": "is",
    "6": "and",
    "7": "we",
    "8": "for",
    "9": "that",
    "10": "this",
    "11": "learning",
    "12": "an",
    "13": "which",
    "14": "maxq",
    "15": "can",
    "16": "paper",
    "17": "it",
    "18": "decision",
    "19": "method",
    "20": "be",
    "21": "by",
    "22": "with",
    "23": "on",
    "24": "function",
    "25": "state",
    "26": "policy",
    "27": "as",
    "28": "are",
    "29": "order",
    "30": "from",
    "31": "hierarchical",
    "32": "performance",
    "33": "classifier",
    "34": "data",
    "35": "approach",
    "36": "target",
    "37": "value",
    "38": "conditions",
    "39": "domains",
    "40": "show",
    "41": "analysis",
    "42": "algorithms",
    "43": "complexity",
    "44": "case",
    "45": "hybrid",
    "46": "induction",
    "47": "inductive",
    "48": "logic",
    "49": "programming",
    "50": "tilde",
    "51": "ilp",
    "52": "its",
    "53": "abstractions",
    "54": "algorithm",
    "55": "experimentally",
    "56": "important",
    "57": "actions",
    "58": "under",
    "59": "cost",
    "60": "such",
    "61": "class",
    "62": "robust",
    "63": "clustering",
    "64": "trees",
    "65": "system",
    "66": "tree",
    "67": "examples",
    "68": "setting",
    "69": "reinforcement",
    "70": "based",
    "71": "functions",
    "72": "five",
    "73": "converges",
    "74": "optimal",
    "75": "known",
    "76": "abstraction",
    "77": "representation",
    "78": "has",
    "79": "makes",
    "80": "non",
    "81": "comparison",
    "82": "many",
    "83": "perform",
    "84": "developed",
    "85": "these",
    "86": "dynamics",
    "87": "constructed",
    "88": "thus",
    "89": "natural",
    "90": "one",
    "91": "reference",
    "92": "kolmogorov",
    "93": "well",
    "94": "may",
    "95": "available",
    "96": "computers",
    "97": "real",
    "98": "efficient",
    "99": "techniques",
    "100": "computational",
    "101": "top",
    "102": "down",
    "103": "tic",
    "104": "propositional",
    "105": "two",
    "106": "memory",
    "107": "agent",
    "108": "partially",
    "109": "observable",
    "110": "cross",
    "111": "validation",
    "112": "presents",
    "113": "decomposing",
    "114": "process",
    "115": "mdp",
    "116": "into",
    "117": "hierarchy",
    "118": "smaller",
    "119": "mdps",
    "120": "proves",
    "121": "results",
    "122": "power",
    "123": "use",
    "124": "recursively",
    "125": "even",
    "126": "experiments",
    "127": "possible",
    "128": "finally",
    "129": "related",
    "130": "work",
    "131": "rl",
    "132": "defined",
    "133": "however",
    "134": "space",
    "135": "define",
    "136": "multiplicative",
    "137": "newton",
    "138": "like",
    "139": "situation",
    "140": "where",
    "141": "restricted",
    "142": "orthogonal",
    "143": "group",
    "144": "general",
    "145": "framework",
    "146": "restriction",
    "147": "problem",
    "148": "second",
    "149": "new",
    "150": "convergence",
    "151": "scaling",
    "152": "each",
    "153": "other",
    "154": "coset",
    "155": "point",
    "156": "any",
    "157": "computer",
    "158": "all",
    "159": "binary",
    "160": "strings",
    "161": "standard",
    "162": "only",
    "163": "they",
    "164": "not",
    "165": "depend",
    "166": "more",
    "167": "useful",
    "168": "if",
    "169": "include",
    "170": "calculus",
    "171": "example",
    "172": "some",
    "173": "world",
    "174": "usually",
    "175": "misclassification",
    "176": "costs",
    "177": "systems",
    "178": "build",
    "179": "best",
    "180": "extends",
    "181": "including",
    "182": "also",
    "183": "roc",
    "184": "adapts",
    "185": "allows",
    "186": "clear",
    "187": "empirical",
    "188": "indeed",
    "189": "problems",
    "190": "presented",
    "191": "aim",
    "192": "employs",
    "193": "first",
    "194": "logical",
    "195": "relational",
    "196": "expressive",
    "197": "efficiency",
    "198": "sets",
    "199": "handled",
    "200": "within",
    "201": "mining",
    "202": "main",
    "203": "assumption",
    "204": "interpretations",
    "205": "up",
    "206": "existing",
    "207": "classical",
    "208": "large",
    "209": "implementations",
    "210": "loads",
    "211": "lds",
    "212": "compare",
    "213": "explore",
    "214": "external",
    "215": "technique",
    "216": "overhead",
    "217": "markov",
    "218": "additive",
    "219": "combination",
    "220": "defines",
    "221": "formal",
    "222": "representational",
    "223": "establishes",
    "224": "safe",
    "225": "online",
    "226": "model",
    "227": "free",
    "228": "wih",
    "229": "probability",
    "230": "kind",
    "231": "locally",
    "232": "presence",
    "233": "kinds",
    "234": "evaluates",
    "235": "through",
    "236": "series",
    "237": "three",
    "238": "shows",
    "239": "much",
    "240": "faster",
    "241": "than",
    "242": "flat",
    "243": "fact",
    "244": "learns",
    "245": "benefit",
    "246": "compute",
    "247": "execute",
    "248": "improved",
    "249": "via",
    "250": "procedure",
    "251": "similar",
    "252": "improvement",
    "253": "step",
    "254": "iteration",
    "255": "demonstrates",
    "256": "effectiveness",
    "257": "execution",
    "258": "concludes",
    "259": "discussion",
    "260": "design",
    "261": "tradeoffs",
    "262": "researchers",
    "263": "have",
    "264": "explored",
    "265": "methods",
    "266": "temporal",
    "267": "abstract",
    "268": "primitive",
    "269": "before",
    "270": "terminating",
    "271": "little",
    "272": "about",
    "273": "aspects",
    "274": "ignored",
    "275": "previous",
    "276": "combined",
    "277": "decomposition",
    "278": "prove",
    "279": "successful",
    "280": "application",
    "281": "author",
    "282": "et",
    "283": "al",
    "284": "extended",
    "285": "without",
    "286": "specifying",
    "287": "though",
    "288": "groups",
    "289": "somewhat",
    "290": "complicated",
    "291": "explicit",
    "292": "expression",
    "293": "amount",
    "294": "individual",
    "295": "jumps",
    "296": "obtained",
    "297": "exactly",
    "298": "convergent",
    "299": "global",
    "300": "instability",
    "301": "inherent",
    "302": "remedied",
    "303": "levenberg",
    "304": "marquardt",
    "305": "type",
    "306": "variation",
    "307": "readily",
    "308": "applied",
    "309": "independent",
    "310": "component",
    "311": "remarkable",
    "312": "illustrated",
    "313": "numerical",
    "314": "simulation",
    "315": "construct",
    "316": "scratch",
    "317": "fourth",
    "318": "cumulant",
    "319": "stochastic",
    "320": "variables",
    "321": "updating",
    "322": "rule",
    "323": "here",
    "324": "homogeneous",
    "325": "nature",
    "326": "lie",
    "327": "numerous",
    "328": "merits",
    "329": "rigorous",
    "330": "treatment",
    "331": "consequence",
    "332": "shown",
    "333": "invariant",
    "334": "componentwise",
    "335": "choosen",
    "336": "identifying",
    "337": "points",
    "338": "transformed",
    "339": "assume",
    "340": "our",
    "341": "move",
    "342": "toward",
    "343": "direction",
    "344": "no",
    "345": "prewhitening",
    "346": "required",
    "347": "given",
    "348": "asymptotic",
    "349": "properties",
    "350": "considered",
    "351": "because",
    "352": "do",
    "353": "argue",
    "354": "refined",
    "355": "practical",
    "356": "simple",
    "357": "restrict",
    "358": "interesting",
    "359": "way",
    "360": "modeling",
    "361": "life",
    "362": "limited",
    "363": "physically",
    "364": "us",
    "365": "give",
    "366": "what",
    "367": "might",
    "368": "look",
    "369": "mathematically",
    "370": "restrictions",
    "371": "error",
    "372": "terms",
    "373": "logarithmic",
    "374": "disappear",
    "375": "keywords",
    "376": "algorithmic",
    "377": "information",
    "378": "theory",
    "379": "environments",
    "380": "difficult",
    "381": "specify",
    "382": "operating",
    "383": "precisely",
    "384": "uncertainty",
    "385": "building",
    "386": "classification",
    "387": "problematic",
    "388": "will",
    "389": "at",
    "390": "least",
    "391": "cases",
    "392": "actually",
    "393": "surpass",
    "394": "across",
    "395": "wide",
    "396": "variety",
    "397": "frameworks",
    "398": "optimization",
    "399": "metrics",
    "400": "accuracy",
    "401": "expected",
    "402": "lift",
    "403": "precision",
    "404": "recall",
    "405": "workforce",
    "406": "utilization",
    "407": "store",
    "408": "update",
    "409": "imprecise",
    "410": "distributions",
    "411": "convex",
    "412": "hull",
    "413": "rocch",
    "414": "combines",
    "415": "geometry",
    "416": "them",
    "417": "particulars",
    "418": "analyzing",
    "419": "learned",
    "420": "classifiers",
    "421": "incremental",
    "422": "minimizes",
    "423": "management",
    "424": "visual",
    "425": "comparisons",
    "426": "sensitivity",
    "427": "analyses",
    "428": "evidence",
    "429": "needed",
    "430": "basic",
    "431": "towards",
    "432": "principles",
    "433": "instance",
    "434": "resulting",
    "435": "methodology",
    "436": "implemented",
    "437": "various",
    "438": "both",
    "439": "when",
    "440": "comparing",
    "441": "attribute",
    "442": "there",
    "443": "trade",
    "444": "off",
    "445": "between",
    "446": "typically",
    "447": "but",
    "448": "less",
    "449": "therefore",
    "450": "current",
    "451": "small",
    "452": "according",
    "453": "standards",
    "454": "community",
    "455": "source",
    "456": "inefficiency",
    "457": "lies",
    "458": "several",
    "459": "so",
    "460": "cannot",
    "461": "independently",
    "462": "unnecessary",
    "463": "scale",
    "464": "explain",
    "465": "context",
    "466": "databases",
    "467": "relate",
    "468": "corresponds",
    "469": "multiple",
    "470": "relations",
    "471": "expressiveness",
    "472": "while",
    "473": "maintaining",
    "474": "extent",
    "475": "study",
    "476": "present",
    "477": "alternative",
    "478": "classic",
    "479": "showing",
    "480": "handle",
    "481": "or",
    "482": "mb",
    "483": "scales",
    "484": "linearly",
    "485": "number",
    "486": "necessary",
    "487": "history",
    "488": "observations",
    "489": "stigmergic",
    "490": "ability",
    "491": "set",
    "492": "bits",
    "493": "included",
    "494": "part",
    "495": "input",
    "496": "need",
    "497": "learn",
    "498": "reactive",
    "499": "highly",
    "500": "markovian",
    "501": "domain",
    "502": "sarsa",
    "503": "lambda",
    "504": "had",
    "505": "success",
    "506": "vaps",
    "507": "due",
    "508": "baird",
    "509": "moore",
    "510": "guarantees",
    "511": "benchmark",
    "512": "generally",
    "513": "applicable",
    "514": "often",
    "515": "employed",
    "516": "machine",
    "517": "disadvantage",
    "518": "straightforward",
    "519": "implementation",
    "520": "reduced",
    "521": "significantly",
    "522": "integrating",
    "523": "normal",
    "524": "discuss",
    "525": "how",
    "526": "adapted",
    "527": "provide",
    "528": "speedups",
    "529": "adaptations",
    "530": "yield",
    "531": "supported",
    "532": "experimental"
  },
  "vocab_size": 532,
  "total_words": 1386
}